Map<String, dynamic> scoreMapper = {
  'open': {
    '營業中': 1,
    '已關店': -1,
    '': 0,
  },
  'crowdedness_dinein': {
    '幾乎沒有客人': 1,
    '有一些空位': 0.5,
    '非常多人在餐廳內': 0.3,
    '': 0,
  },
  'crowdedness_takeout': {
    '幾乎沒有客人': 1,
    '有些人在排隊': 0.5,
    '非常多人在排隊': 0.3,
    '': 0,
  },
  'safety': {
    '實名制、簽名': 1,
    '座位擺設安全距離': 5,
    '座位間放置防疫隔板': 10,
    '': 0,
  },
  'covid_change': {
    '沒有提供疫情特殊餐點': -1,
    '有提供疫情特殊餐點': 1,
    '': 0,
  },
  'parking': {
    '沒有停車位': -1,
    '還有停車位': 1,
    '': 0,
  },
  'wifi': {
    '沒有WIFI': -1,
    '有WIFI': 1,
    '': 0,
  },
  'air_conditioning': {
    '沒有冷氣': -1,
    '有冷氣': 1,
    '': 0,
  },
  'tv': {
    '沒有電視': -1,
    '有電視': 1,
    '': 0,
  },
  'music': {
    '沒有音樂': -1,
    '有音樂': 1,
    '': 0,
  },
  'promotion': {
    '沒有特殊優惠': -1,
    '有特殊優惠': 1,
    '': 0,
  },
};
